GopalSaraf/Practicals/PSDL/include/proc/pic16f1509.inc
// Register: CLC1CON
#define CLC1CON CLC1CON
CLC1CON                                  equ 0F10h
// bitfield definitions
CLC1CON_LC1MODE0_POSN                    equ 0000h
CLC1CON_LC1MODE0_POSITION                equ 0000h
CLC1CON_LC1MODE0_SIZE                    equ 0001h
CLC1CON_LC1MODE0_LENGTH                  equ 0001h
CLC1CON_LC1MODE0_MASK                    equ 0001h
CLC1CON_LC1MODE1_POSN                    equ 0001h
CLC1CON_LC1MODE1_POSITION                equ 0001h
CLC1CON_LC1MODE1_SIZE                    equ 0001h
CLC1CON_LC1MODE1_LENGTH                  equ 0001h
CLC1CON_LC1MODE1_MASK                    equ 0002h
CLC1CON_LC1MODE2_POSN                    equ 0002h
CLC1CON_LC1MODE2_POSITION                equ 0002h
CLC1CON_LC1MODE2_SIZE                    equ 0001h
CLC1CON_LC1MODE2_LENGTH                  equ 0001h
CLC1CON_LC1MODE2_MASK                    equ 0004h
CLC1CON_LC1INTN_POSN                     equ 0003h
CLC1CON_LC1INTN_POSITION                 equ 0003h
CLC1CON_LC1INTN_SIZE                     equ 0001h
CLC1CON_LC1INTN_LENGTH                   equ 0001h
CLC1CON_LC1INTN_MASK                     equ 0008h
CLC1CON_LC1INTP_POSN                     equ 0004h
CLC1CON_LC1INTP_POSITION                 equ 0004h
CLC1CON_LC1INTP_SIZE                     equ 0001h
CLC1CON_LC1INTP_LENGTH                   equ 0001h
CLC1CON_LC1INTP_MASK                     equ 0010h
CLC1CON_LC1OUT_POSN                      equ 0005h
CLC1CON_LC1OUT_POSITION                  equ 0005h
CLC1CON_LC1OUT_SIZE                      equ 0001h
CLC1CON_LC1OUT_LENGTH                    equ 0001h
CLC1CON_LC1OUT_MASK                      equ 0020h
CLC1CON_LC1OE_POSN                       equ 0006h
CLC1CON_LC1OE_POSITION                   equ 0006h
CLC1CON_LC1OE_SIZE                       equ 0001h
CLC1CON_LC1OE_LENGTH                     equ 0001h
CLC1CON_LC1OE_MASK                       equ 0040h
CLC1CON_LC1EN_POSN                       equ 0007h
CLC1CON_LC1EN_POSITION                   equ 0007h
CLC1CON_LC1EN_SIZE                       equ 0001h
CLC1CON_LC1EN_LENGTH                     equ 0001h
CLC1CON_LC1EN_MASK                       equ 0080h
CLC1CON_LCMODE0_POSN                     equ 0000h
CLC1CON_LCMODE0_POSITION                 equ 0000h
CLC1CON_LCMODE0_SIZE                     equ 0001h
CLC1CON_LCMODE0_LENGTH                   equ 0001h
CLC1CON_LCMODE0_MASK                     equ 0001h
CLC1CON_LCMODE1_POSN                     equ 0001h
CLC1CON_LCMODE1_POSITION                 equ 0001h
CLC1CON_LCMODE1_SIZE                     equ 0001h
CLC1CON_LCMODE1_LENGTH                   equ 0001h
CLC1CON_LCMODE1_MASK                     equ 0002h
CLC1CON_LCMODE2_POSN                     equ 0002h
CLC1CON_LCMODE2_POSITION                 equ 0002h
CLC1CON_LCMODE2_SIZE                     equ 0001h
CLC1CON_LCMODE2_LENGTH                   equ 0001h
CLC1CON_LCMODE2_MASK                     equ 0004h
CLC1CON_LCINTN_POSN                      equ 0003h
CLC1CON_LCINTN_POSITION                  equ 0003h
CLC1CON_LCINTN_SIZE                      equ 0001h
CLC1CON_LCINTN_LENGTH                    equ 0001h
CLC1CON_LCINTN_MASK                      equ 0008h
CLC1CON_LCINTP_POSN                      equ 0004h
CLC1CON_LCINTP_POSITION                  equ 0004h
CLC1CON_LCINTP_SIZE                      equ 0001h
CLC1CON_LCINTP_LENGTH                    equ 0001h
CLC1CON_LCINTP_MASK                      equ 0010h
CLC1CON_LCOUT_POSN                       equ 0005h
CLC1CON_LCOUT_POSITION                   equ 0005h
CLC1CON_LCOUT_SIZE                       equ 0001h
CLC1CON_LCOUT_LENGTH                     equ 0001h
CLC1CON_LCOUT_MASK                       equ 0020h
CLC1CON_LCOE_POSN                        equ 0006h
CLC1CON_LCOE_POSITION                    equ 0006h
CLC1CON_LCOE_SIZE                        equ 0001h
CLC1CON_LCOE_LENGTH                      equ 0001h
CLC1CON_LCOE_MASK                        equ 0040h
CLC1CON_LCEN_POSN                        equ 0007h
CLC1CON_LCEN_POSITION                    equ 0007h
CLC1CON_LCEN_SIZE                        equ 0001h
CLC1CON_LCEN_LENGTH                      equ 0001h
CLC1CON_LCEN_MASK                        equ 0080h
CLC1CON_LC1MODE_POSN                     equ 0000h
CLC1CON_LC1MODE_POSITION                 equ 0000h
CLC1CON_LC1MODE_SIZE                     equ 0003h
CLC1CON_LC1MODE_LENGTH                   equ 0003h
CLC1CON_LC1MODE_MASK                     equ 0007h

// Register: CLC1POL
#define CLC1POL CLC1POL
CLC1POL                                  equ 0F11h
// bitfield definitions
CLC1POL_LC1G1POL_POSN                    equ 0000h
CLC1POL_LC1G1POL_POSITION                equ 0000h
CLC1POL_LC1G1POL_SIZE                    equ 0001h
CLC1POL_LC1G1POL_LENGTH                  equ 0001h
CLC1POL_LC1G1POL_MASK                    equ 0001h
CLC1POL_LC1G2POL_POSN                    equ 0001h
CLC1POL_LC1G2POL_POSITION                equ 0001h
CLC1POL_LC1G2POL_SIZE                    equ 0001h
CLC1POL_LC1G2POL_LENGTH                  equ 0001h
CLC1POL_LC1G2POL_MASK                    equ 0002h
CLC1POL_LC1G3POL_POSN                    equ 0002h
CLC1POL_LC1G3POL_POSITION                equ 0002h
CLC1POL_LC1G3POL_SIZE                    equ 0001h
CLC1POL_LC1G3POL_LENGTH                  equ 0001h
CLC1POL_LC1G3POL_MASK                    equ 0004h
CLC1POL_LC1G4POL_POSN                    equ 0003h
CLC1POL_LC1G4POL_POSITION                equ 0003h
CLC1POL_LC1G4POL_SIZE                    equ 0001h
CLC1POL_LC1G4POL_LENGTH                  equ 0001h
CLC1POL_LC1G4POL_MASK                    equ 0008h
CLC1POL_LC1POL_POSN                      equ 0007h
CLC1POL_LC1POL_POSITION                  equ 0007h
CLC1POL_LC1POL_SIZE                      equ 0001h
CLC1POL_LC1POL_LENGTH                    equ 0001h
CLC1POL_LC1POL_MASK                      equ 0080h
CLC1POL_G1POL_POSN                       equ 0000h
CLC1POL_G1POL_POSITION                   equ 0000h
CLC1POL_G1POL_SIZE                       equ 0001h
CLC1POL_G1POL_LENGTH                     equ 0001h
CLC1POL_G1POL_MASK                       equ 0001h
CLC1POL_G2POL_POSN                       equ 0001h
CLC1POL_G2POL_POSITION                   equ 0001h
CLC1POL_G2POL_SIZE                       equ 0001h
CLC1POL_G2POL_LENGTH                     equ 0001h
CLC1POL_G2POL_MASK                       equ 0002h
CLC1POL_G3POL_POSN                       equ 0002h
CLC1POL_G3POL_POSITION                   equ 0002h
CLC1POL_G3POL_SIZE                       equ 0001h
CLC1POL_G3POL_LENGTH                     equ 0001h
CLC1POL_G3POL_MASK                       equ 0004h
CLC1POL_G4POL_POSN                       equ 0003h
CLC1POL_G4POL_POSITION                   equ 0003h
CLC1POL_G4POL_SIZE                       equ 0001h
CLC1POL_G4POL_LENGTH                     equ 0001h
CLC1POL_G4POL_MASK                       equ 0008h
CLC1POL_POL_POSN                         equ 0007h
CLC1POL_POL_POSITION                     equ 0007h
CLC1POL_POL_SIZE                         equ 0001h
CLC1POL_POL_LENGTH                       equ 0001h
CLC1POL_POL_MASK                         equ 0080h

// Register: CLC1SEL0
#define CLC1SEL0 CLC1SEL0
CLC1SEL0                                 equ 0F12h
// bitfield definitions
CLC1SEL0_LC1D1S0_POSN                    equ 0000h
CLC1SEL0_LC1D1S0_POSITION                equ 0000h
CLC1SEL0_LC1D1S0_SIZE                    equ 0001h
CLC1SEL0_LC1D1S0_LENGTH                  equ 0001h
CLC1SEL0_LC1D1S0_MASK                    equ 0001h
CLC1SEL0_LC1D1S1_POSN                    equ 0001h
CLC1SEL0_LC1D1S1_POSITION                equ 0001h
CLC1SEL0_LC1D1S1_SIZE                    equ 0001h
CLC1SEL0_LC1D1S1_LENGTH                  equ 0001h
CLC1SEL0_LC1D1S1_MASK                    equ 0002h
CLC1SEL0_LC1D1S2_POSN                    equ 0002h
CLC1SEL0_LC1D1S2_POSITION                equ 0002h
CLC1SEL0_LC1D1S2_SIZE                    equ 0001h
CLC1SEL0_LC1D1S2_LENGTH                  equ 0001h
CLC1SEL0_LC1D1S2_MASK                    equ 0004h
CLC1SEL0_LC1D2S0_POSN                    equ 0004h
CLC1SEL0_LC1D2S0_POSITION                equ 0004h
CLC1SEL0_LC1D2S0_SIZE                    equ 0001h
CLC1SEL0_LC1D2S0_LENGTH                  equ 0001h
CLC1SEL0_LC1D2S0_MASK                    equ 0010h
CLC1SEL0_LC1D2S1_POSN                    equ 0005h
CLC1SEL0_LC1D2S1_POSITION                equ 0005h
CLC1SEL0_LC1D2S1_SIZE                    equ 0001h
CLC1SEL0_LC1D2S1_LENGTH                  equ 0001h
CLC1SEL0_LC1D2S1_MASK                    equ 0020h
CLC1SEL0_LC1D2S2_POSN                    equ 0006h
CLC1SEL0_LC1D2S2_POSITION                equ 0006h
CLC1SEL0_LC1D2S2_SIZE                    equ 0001h
CLC1SEL0_LC1D2S2_LENGTH                  equ 0001h
CLC1SEL0_LC1D2S2_MASK                    equ 0040h
CLC1SEL0_D1S0_POSN                       equ 0000h
CLC1SEL0_D1S0_POSITION                   equ 0000h
CLC1SEL0_D1S0_SIZE                       equ 0001h
CLC1SEL0_D1S0_LENGTH                     equ 0001h
CLC1SEL0_D1S0_MASK                       equ 0001h
CLC1SEL0_D1S1_POSN                       equ 0001h
CLC1SEL0_D1S1_POSITION                   equ 0001h
CLC1SEL0_D1S1_SIZE                       equ 0001h
CLC1SEL0_D1S1_LENGTH                     equ 0001h
CLC1SEL0_D1S1_MASK                       equ 0002h
CLC1SEL0_D1S2_POSN                       equ 0002h
CLC1SEL0_D1S2_POSITION                   equ 0002h
CLC1SEL0_D1S2_SIZE                       equ 0001h
CLC1SEL0_D1S2_LENGTH                     equ 0001h
CLC1SEL0_D1S2_MASK                       equ 0004h
CLC1SEL0_D2S0_POSN                       equ 0004h
CLC1SEL0_D2S0_POSITION                   equ 0004h
CLC1SEL0_D2S0_SIZE                       equ 0001h
CLC1SEL0_D2S0_LENGTH                     equ 0001h
CLC1SEL0_D2S0_MASK                       equ 0010h
CLC1SEL0_D2S1_POSN                       equ 0005h
CLC1SEL0_D2S1_POSITION                   equ 0005h
CLC1SEL0_D2S1_SIZE                       equ 0001h
CLC1SEL0_D2S1_LENGTH                     equ 0001h
CLC1SEL0_D2S1_MASK                       equ 0020h
CLC1SEL0_D2S2_POSN                       equ 0006h
CLC1SEL0_D2S2_POSITION                   equ 0006h
CLC1SEL0_D2S2_SIZE                       equ 0001h
CLC1SEL0_D2S2_LENGTH                     equ 0001h
CLC1SEL0_D2S2_MASK                       equ 0040h
CLC1SEL0_LC1D1S_POSN                     equ 0000h
CLC1SEL0_LC1D1S_POSITION                 equ 0000h
CLC1SEL0_LC1D1S_SIZE                     equ 0003h
CLC1SEL0_LC1D1S_LENGTH                   equ 0003h
CLC1SEL0_LC1D1S_MASK                     equ 0007h
CLC1SEL0_LC1D2S_POSN                     equ 0004h
CLC1SEL0_LC1D2S_POSITION                 equ 0004h
CLC1SEL0_LC1D2S_SIZE                     equ 0003h
CLC1SEL0_LC1D2S_LENGTH                   equ 0003h
CLC1SEL0_LC1D2S_MASK                     equ 0070h

// Register: CLC1SEL1
#define CLC1SEL1 CLC1SEL1
CLC1SEL1                                 equ 0F13h
// bitfield definitions
CLC1SEL1_LC1D3S0_POSN                    equ 0000h
CLC1SEL1_LC1D3S0_POSITION                equ 0000h
CLC1SEL1_LC1D3S0_SIZE                    equ 0001h
CLC1SEL1_LC1D3S0_LENGTH                  equ 0001h
CLC1SEL1_LC1D3S0_MASK                    equ 0001h
CLC1SEL1_LC1D3S1_POSN                    equ 0001h
CLC1SEL1_LC1D3S1_POSITION                equ 0001h
CLC1SEL1_LC1D3S1_SIZE                    equ 0001h
CLC1SEL1_LC1D3S1_LENGTH                  equ 0001h
CLC1SEL1_LC1D3S1_MASK                    equ 0002h
CLC1SEL1_LC1D3S2_POSN                    equ 0002h
CLC1SEL1_LC1D3S2_POSITION                equ 0002h
CLC1SEL1_LC1D3S2_SIZE                    equ 0001h
CLC1SEL1_LC1D3S2_LENGTH                  equ 0001h
CLC1SEL1_LC1D3S2_MASK                    equ 0004h
CLC1SEL1_LC1D4S0_POSN                    equ 0004h
CLC1SEL1_LC1D4S0_POSITION                equ 0004h
CLC1SEL1_LC1D4S0_SIZE                    equ 0001h
CLC1SEL1_LC1D4S0_LENGTH                  equ 0001h
CLC1SEL1_LC1D4S0_MASK                    equ 0010h
CLC1SEL1_LC1D4S1_POSN                    equ 0005h
CLC1SEL1_LC1D4S1_POSITION                equ 0005h
CLC1SEL1_LC1D4S1_SIZE                    equ 0001h
CLC1SEL1_LC1D4S1_LENGTH                  equ 0001h
CLC1SEL1_LC1D4S1_MASK                    equ 0020h
CLC1SEL1_LC1D4S2_POSN                    equ 0006h
CLC1SEL1_LC1D4S2_POSITION                equ 0006h
CLC1SEL1_LC1D4S2_SIZE                    equ 0001h
CLC1SEL1_LC1D4S2_LENGTH                  equ 0001h
CLC1SEL1_LC1D4S2_MASK                    equ 0040h
CLC1SEL1_D3S0_POSN                       equ 0000h
CLC1SEL1_D3S0_POSITION                   equ 0000h
CLC1SEL1_D3S0_SIZE                       equ 0001h
CLC1SEL1_D3S0_LENGTH                     equ 0001h
CLC1SEL1_D3S0_MASK                       equ 0001h
CLC1SEL1_D3S1_POSN                       equ 0001h
CLC1SEL1_D3S1_POSITION                   equ 0001h
CLC1SEL1_D3S1_SIZE                       equ 0001h
CLC1SEL1_D3S1_LENGTH                     equ 0001h
CLC1SEL1_D3S1_MASK                       equ 0002h
CLC1SEL1_D3S2_POSN                       equ 0002h
CLC1SEL1_D3S2_POSITION                   equ 0002h
CLC1SEL1_D3S2_SIZE                       equ 0001h
CLC1SEL1_D3S2_LENGTH                     equ 0001h
CLC1SEL1_D3S2_MASK                       equ 0004h
CLC1SEL1_D4S0_POSN                       equ 0004h
CLC1SEL1_D4S0_POSITION                   equ 0004h
CLC1SEL1_D4S0_SIZE                       equ 0001h
CLC1SEL1_D4S0_LENGTH                     equ 0001h
CLC1SEL1_D4S0_MASK                       equ 0010h
CLC1SEL1_D4S1_POSN                       equ 0005h
CLC1SEL1_D4S1_POSITION                   equ 0005h
CLC1SEL1_D4S1_SIZE                       equ 0001h
CLC1SEL1_D4S1_LENGTH                     equ 0001h
CLC1SEL1_D4S1_MASK                       equ 0020h
CLC1SEL1_D4S2_POSN                       equ 0006h
CLC1SEL1_D4S2_POSITION                   equ 0006h
CLC1SEL1_D4S2_SIZE                       equ 0001h
CLC1SEL1_D4S2_LENGTH                     equ 0001h
CLC1SEL1_D4S2_MASK                       equ 0040h
CLC1SEL1_LC1D3S_POSN                     equ 0000h
CLC1SEL1_LC1D3S_POSITION                 equ 0000h
CLC1SEL1_LC1D3S_SIZE                     equ 0003h
CLC1SEL1_LC1D3S_LENGTH                   equ 0003h
CLC1SEL1_LC1D3S_MASK                     equ 0007h
CLC1SEL1_LC1D4S_POSN                     equ 0004h
CLC1SEL1_LC1D4S_POSITION                 equ 0004h
CLC1SEL1_LC1D4S_SIZE                     equ 0003h
CLC1SEL1_LC1D4S_LENGTH                   equ 0003h
CLC1SEL1_LC1D4S_MASK                     equ 0070h

